## Numpy Assignment 2

- Student Name:
- Student RegNo:

### Instructions
- Please answer the exercises to the best of your knowledge.
- The assignment is out of 10 marks and will contribute partially to your final result.

In [16]:
import numpy as np
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset('titanic')

In [12]:

#A function that creates a random dataset
# with numerical and categorical features
def create_dataset(n_samples, n_features, n_classes):
    #set the seed
    np.random.seed(42)
    X = np.random.randn(n_samples, n_features)
    y = np.random.randint(0, n_classes, n_samples)
    #combing the numerical and categorical features
    z = np.hstack((X, y.reshape(-1, 1)))
    # add random column names to the dataset
    z = pd.DataFrame(z, columns=['col' + str(i) for i in range(n_features + 1)])
    # add a column with random strings combinations
    z['string'] = np.random.choice(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z'], n_samples)
    # return the dataset
    return z

In [13]:
#use the function above to create a dataframe.
df = create_dataset(50,5,2)

In [14]:
#check the dimensions of the data
df.shape

(50, 7)

In [15]:
#display the first few rows
df.head()

       col0      col1      col2      col3      col4  col5 string
0  0.496714 -0.138264  0.647689  1.523030 -0.234153   1.0      b
1 -0.234137  1.579213  0.767435 -0.469474  0.542560   0.0      t
2 -0.463418 -0.465730  0.241962 -1.913280 -1.724918   0.0      j
3 -0.562288 -1.012831  0.314247 -0.908024 -1.412304   0.0      z
4  1.465649 -0.225776  0.067528 -1.424748 -0.544383   1.0      s

In [ ]:
# slice the first two columns and first two rows from the dataset

In [ ]:
# slice the last two columns and and las two rows from the dataset

In [ ]:
# check the column data types in the dataset

In [ ]:
# use the describe function to display the stats of the data.

In [ ]:
# calculate the sums of the data by row

In [ ]:
# calculate the sums of the data by column

In [ ]:
# create a new column by combining two random columns in the data through - addition, or multiplication
# call the column: new_col

In [ ]:
# create two random datasets from the function above and use the merge function to combine them
# name the two dataframes appropriately

In [ ]:
#create three random datasets and concatenate them to form one result df z

In [ ]:
# create two datasets and join them based on one common variable

In [ ]:
# create a dataset called p and groupby the string column and calculate sums

In [ ]:
# create a dataframe called h and use iloc to slice the columns 3-5 and rows 3-4

In [ ]:
# can you use the same dataset h but use loc function to slice the data?
# please leave your explanation if not.

In [17]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
# please group the dataset titanic by sex and calculate the average age

In [ ]:
# what is the average age of women that died in that titanic?

In [ ]:
# how many of the people who embarked in Southampton were male and died?

In [ ]:
# what is the average fare of a man in First Class

In [ ]:
# Return the indexes of all the people that died in the titanic

In [ ]:
# drop all the indexes of those people and create a new df called aliveTitanic

In [ ]:
# how many were not adult males?